MONGO_URL = 'localhost'
MONGO_DB = 'bossZhipinJob'
MONGO_TABLE = 'bossZhipin'

url = "https://www.zhipin.com"
keyWord = "前端"

# excludes = {"使用","工作","以上","相关","能够","优先","具备","构建","产品","各种","一定","具有","常见","要求","至少","一种","进行","以及","岗位职责","完成"}
# excludes = {"熟悉","开发","前端","能力","技术","使用","框架","熟练","了解","工作","以上","前端开发","工具","相关","以上学历","良好","精通","熟练掌握","掌握","能够","沟通","优先","项目","专业","主流","具备","学习","构建","产品","各种","性能","计算机相关","本科","一定","分析","应用","组件","问题","代码","设计","架构","布局","理解","独立","具有","移动","常见","交互","深入","原理","协作","负责","Web","要求","业务","至少","一种","页面","体验","进行","用户","平台","需求","以及","岗位职责","完成","基础","实现","任职","公司","标准"}
excludes = {"熟悉","能力","开发","良好","技术","了解","框架","优先","前端","使用","相关","工作","熟练","团队","基础","学习","具有","以上学历","专业","具备","编程","扎实","一定","前端开发","精通","以上","设计","精神","项目","熟练掌握","至少","一种","善于"}
num = 20